data/oforg_channel1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0  0 0)
    (1  0 0)
    (1 10 0)
    (0 10 0)
    (0  0 0.1)
    (1  0 0.1)
    (1 10 0.1)
    (0 10 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

boundary
(
    left
    {
        type symmetry;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
