data/oforg_channel1/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.00754;

boundaryField
{
    bottom
    {
        type            fixedValue;
        value           uniform 0.00754;
    }

    top
    {
        type zeroGradient;
    }

    right
    {
        type            epsilonWallFunction;
        value           uniform 0.00754;
    }

  #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
