data/oforg_channel1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375;

boundaryField
{
    bottom
    {
        type            fixedValue;
        value           uniform 0.00375;
    }

    top
    {
        type  zeroGradient;
    }

    right
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
